app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 3)
INSERT INTO "comments" ("created_at", "body", "updated_at", "post_id", "commenter") VALUES('2010-01-22 21:09:40', 'jkjhdkjhskjdhk', '2010-01-22 21:09:40', 3, NULL)
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create!(params[:comment])