app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT * FROM "posts"

  def show
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 3) LIMIT 1

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("createdby", "created_at", "updated_at", "texto", "resumo", "assunto") VALUES(NULL, '2010-01-22 19:27:27', '2010-01-22 19:27:27', 'xfsdfs', 'sdfsdfsd', 'sdfsdf')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 3)
UPDATE "posts" SET "updated_at" = '2010-01-22 16:33:09', "resumo" = 'Volta e meia aparece a necessidade de criar uma consist&ecirc;ncia adicional